Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྤྲོས་པ་དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ནི་ཟད་པའི་རྣམ་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, if you ask how the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the collected and diffused thoughts of those beings, it is the case, Subhūti, that the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the collected and diffused thoughts of those beings as aspects of the extinction of contaminants.

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ནི་འདོད་ཆགས་དང་བྲལ་བ་དང་། འགག་པ་དང་། སྤོང་བའི་རྣམ་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the collected and diffused thoughts of those beings as aspects of nonattachment, cessation, and rejection.

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ནི་ཞི་བ་དང་། དབེན་པའི་རྣམ་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the collected and diffused thoughts of those beings as aspects of peace and voidness.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་སེམས་ཅན་དེ་དག་གི་སེམས་བསྡུས་པ་དང་། སྤྲོས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the collected and diffused thoughts of those beings. “

source: རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་འདོད་ཆགས་དང་བཅས་པ་ལ། འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know that the thoughts of those beings who are afflicted with desire are thoughts afflicted with desire.

source: །འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ལ། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They correctly and definitively know that the thoughts of those beings who are free from desire are thoughts free from desire.

source: །ཞེ་སྡང་དང་བཅས་པའི་སེམས་ལ། ཞེ་སྡང་དང་བཅས་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They correctly and definitively know that the thoughts of those beings afflicted with hatred are thoughts afflicted with hatred.

source: །ཞེ་སྡང་དང་བྲལ་བའི་སེམས་ལ། ཞེ་སྡང་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །གཏི་མུག་དང་བཅས་པའི་སེམས་ལ།
en: They correctly and definitively know that the thoughts of those beings who are free from hatred are thoughts free from hatred.

source: གཏི་མུག་དང་བཅས་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They correctly and definitively know that the thoughts of those beings afflicted with delusion are thoughts afflicted with delusion. {Ki.

source: །གཏི་མུག་དང་བྲལ་བའི་སེམས་ལ། གཏི་མུག་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: IV: 61} They correctly and definitively know that the thoughts of those beings who are free from delusion are thoughts free from delusion.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་དེ་དག་གི་སེམས་འདོད་ཆགས་དང་བཅས་པ་ལ། འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཤེས་བགྱི་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་པ་ལགས།
en: Blessed Lord, how do the tathāgatas, arhats, completely awakened buddhas correctly and definitively know that the thoughts of those beings who are afflicted with desire are thoughts afflicted with desire?

source: ཇི་ལྟར་ན་ཞེ་སྡང་དང་བཅས་པ་དང་། གཏི་མུག་དང་བཅས་པ་ལ་གཏི་མུག་དང་བཅས་པའི་སེམས་ཤེས་བགྱི་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་པ་ལགས།
en: How do they correctly and definitively know that the thoughts of beings afflicted with hatred and afflicted with delusion are thoughts afflicted with [hatred and] delusion?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སེམས་འདོད་ཆགས་དང་བཅས་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཀྱི་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་མ་ཡིན་ནོ།
en: Subhūti,” replied the Blessed One, “thoughts that are afflicted with desire are not the genuine and definitive reality of thought.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དམིགས་སུ་མེད་དོ།
en: If you ask why, Subhūti, mind is not apprehensible as genuine and definitive reality.

source: །སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱང་དམིགས་སུ་མེད་ན། འདོད་ཆགས་དང་བཅས་པ་འམ། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས།
en: If phenomena that originate from the mind are nonapprehensible, how could thoughts that are afflicted with desire or free from desire possibly be apprehended! “

source: རབ་འབྱོར་སེམས་ཞེ་སྡང་དང་བཅས་པ་གང་ཡིན་པ་དེ་ནི། སེམས་ཀྱི་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་མ་ཡིན་ནོ།
en: Subhūti, thoughts that are afflicted with hatred are not the genuine and definitive reality of thought.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དམིགས་སུ་མེད་དེ།
en: If you ask why, Subhūti, thought is not apprehensible as genuine and definitive reality.

source: སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱང་དམིགས་སུ་མེད་ན། ཞེ་སྡང་དང་བཅས་པ་འམ། ཞེ་སྡང་དང་བྲལ་བའི་སེམས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས།
en: If phenomena that originate from the mind are nonapprehensible, how could thoughts that are afflicted with hatred or free from hatred possibly be apprehended! “

source: རབ་འབྱོར་སེམས་གཏི་མུག་དང་བཅས་པ་གང་ཡིན་པ་དེ་ནི། སེམས་ཀྱི་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་མ་ཡིན་ནོ།
en: Subhūti, thoughts that are afflicted with delusion are not the genuine and definitive reality of thought.

source: སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱང་དམིགས་སུ་མེད་ན། གཏི་མུག་དང་བཅས་པ་འམ། གཏི་མུག་དང་བྲལ་བའི་སེམས་དམིགས་པ་ལྟ་ཅི་ཞིག་སྨོས།
en: If phenomena that originate from the mind are nonapprehensible, how could thoughts that are afflicted with delusion or free from delusion possibly be apprehended! “

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་དེ་དག་གི་སེམས་འདོད་ཆགས་དང་བཅས་པ་ལ་འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, it is in that manner that the tathāgatas correctly and definitively know, dependent on this perfection of wisdom, that the thoughts of those beings that are afflicted with desire are thoughts afflicted with desire.

source: །གཏི་མུག་དང་བཅས་པའི་སེམས་ལ། གཏི་མུག་དང་བཅས་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They correctly and definitively know that thoughts afflicted with delusion are thoughts afflicted with delusion. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་འདོད་ཆགས་དང་བྲལ་བ་ལ་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་སེམས་འདོད་ཆགས་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི། སེམས་ཀྱི་འདོད་ཆགས་དང་བཅས་པ་ཉིད་མ་ཡིན། འདོད་ཆགས་དང་བྲལ་བ་ཉིད་མ་ཡིན་ནོ།
en: Subhūti, if you ask how the tathāgatas correctly and definitively know that the thoughts of those beings that are free from desire are thoughts free from desire, in this case, Subhūti, thoughts that are free from desire constitute neither a state of thought with desire, nor a state [of thought] without desire.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་གཉིས་འགྲོགས་ཤིང་ཕྲད་པ་མེད་དེ།
en: If you ask why, Subhūti, there is no association and no meeting of two sorts of thought.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་འདོད་ཆགས་དང་བྲལ་བ་ལ། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, it is in this manner that the tathāgatas correctly and definitively know that the thoughts of those beings that are free from desire are thoughts free from desire. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་སེམས་ཅན་དེ་དག་གི་སེམས་ཞེ་སྡང་དང་བྲལ་བ་ལ། ཞེ་སྡང་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་སེམས་ཞེ་སྡང་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི། སེམས་ཀྱི་ཞེ་སྡང་དང་བཅས་པ་ཉིད་མ་ཡིན་ཏེ། ཞེ་སྡང་དང་བྲལ་བ་ཉིད་མ་ཡིན་ནོ།
en: Subhūti, if you ask how the tathāgatas correctly and definitively know that the thoughts of those beings that are free from hatred are thoughts free from hatred, in this case, Subhūti, thoughts that are free from hatred constitute neither a state of thought with hatred, nor a state of thought without hatred.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་ཞེ་སྡང་དང་བྲལ་བ་ལ། ཞེ་སྡང་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, it is in that manner that the tathāgatas correctly and definitively know that the thoughts of those beings that are free from hatred are thoughts free from hatred. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་གཏི་མུག་དང་བྲལ་བ་ལ། གཏི་མུག་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་སེམས་གཏི་མུག་དང་བྲལ་བ་དེ་ནི། སེམས་ཀྱི་གཏི་མུག་དང་བཅས་པ་ཉིད་མ་ཡིན། གཏི་མུག་དང་བྲལ་བ་ཉིད་མ་ཡིན་ནོ།
en: Subhūti, if you ask how the tathāgatas correctly and definitively know that the thoughts of those beings that are free from delusion are thoughts free from delusion, in this case, Subhūti, thoughts that are free from delusion constitute neither a state of thought with delusion, nor a state of thought without delusion.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གི་སེམས་གཏི་མུག་དང་བྲལ་བ་ལ། གཏི་མུག་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་།
en: Subhūti, it is in that manner that the tathāgatas correctly and definitively know that the thoughts of those beings that are free from delusion are thoughts free from delusion. “

source: གང་ཟག་ཕ་རོལ་གྱི་སེམས་རྒྱ་ཆེ་བ་ལ། སེམས་རྒྱ་ཆེ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་རྒྱ་ཆེ་བ་ལ།
en: Moreover, Subhūti, the tathāgatas correctly and definitively know, dependent on this profound perfection of wisdom, that the extensive thoughts of other beings and other persons are extensive thoughts.

source: སེམས་རྒྱ་ཆེ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་དེ་རྒྱ་ཆེ་བར་མི་འགྱུར། སེམས་དེ་རྒྱ་ཆུང་བར་མི་འགྱུར།
en: Subhūti, if you ask how the tathāgatas correctly and definitively know, dependent on this profound perfection of wisdom, that the extensive thoughts of other beings and other persons are extensive thoughts, in that case, Subhūti, the tathāgatas, arhats, completely awakened buddhas know that the thoughts of other beings and of other persons do not increase and their thoughts do not decrease.

source: སེམས་དེ་འཕེལ་བར་མི་འགྱུར། སེམས་དེ་འགྲིབ་བར་མི་འགྱུར།
en: Their thoughts are not enhanced and their thoughts are not diminished.

source: སེམས་དེ་འོང་བར་མི་འགྱུར། སེམས་དེ་འགྲོ་བར་མི་འགྱུར་ཏེ།
en: Their thoughts do not come and their thoughts do not go.

source: སེམས་དེ་དངོས་པོ་མེད་པས་རྒྱ་ཆེ་བར་འགྱུར་བ་མ་ཡིན། རྒྱ་ཆུང་བར་འགྱུར་བ་མ་ཡིན། འཕེལ་བར་འགྱུར་བ་མ་ཡིན། འགྲིབ་པར་འགྱུར་བ་མ་ཡིན། འོང་བར་འགྱུར་བ་མ་ཡིན། འགྲོ་བར་འགྱུར་བ་མ་ཡིན་ནོ།
en: Because they are nonentities, thoughts neither increase nor decrease, they are neither enhanced nor diminished, and they neither come nor go. {

source: །ཞེས་བྱ་བར་རབ་ཏུ་མཁྱེན་ཏོ།
en: Ki.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་སེམས་ལ་གང་གིས་རྒྱ་ཆེན་པོར་འགྱུར་བའམ། རྒྱ་ཆུང་ངུར་འགྱུར་བའམ། འཕེལ་བར་འགྱུར་བའམ། འགྲིབ་པར་འགྱུར་བའམ།
en: IV: 62} If you ask why, it is because thoughts are without any essential nature by which they could be increased or decreased, be enhanced or diminished, or come or go.

source: འོང་བར་འགྱུར་བའམ། འགྲོ་བར་འགྱུར་བའི་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ།
en: Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas know this profound perfection of wisdom.

source: སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་རྒྱ་ཆེ་བ་ལ། སེམས་རྒྱ་ཆེ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: They correctly and definitively know that the extensive thoughts of other beings and other persons are extensive thoughts. “

source: །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་ཀྱི་སེམས་ཡངས་པ་ལ། སེམས་ཡངས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the grand thoughts of other beings and of other persons are grand thoughts.

source: །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཡངས་པ་ལ་སེམས་ཡངས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས།
en: Subhūti, if you ask how the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the grand thoughts of other beings and other persons are grand thoughts, in that case, Subhūti, the tathāgatas, arhats, completely awakened buddhas do not see that the thoughts of other beings and of other persons come or go.

source: སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་དེ་ལ་འོང་བ་དང་། འགྲོ་བ་མི་གཟིགས་སོ། །སྐྱེ་བ་དང་འགག་པ་དང་གནས་པ་དང་གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་མི་གཟིགས་སོ།
en: They do not see that they arise or cease, or are either stable or fluctuating.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་དེ་ལ་གང་འོང་བར་འགྱུར་བའམ། འགྲོ་བར་འགྱུར་བའམ། སྐྱེ་བར་འགྱུར་བའམ། འགག་པར་འགྱུར་བའམ། གནས་པར་འགྱུར་བའམ། གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་དེ་ལྟ་བུའི་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, Subhūti, it is because thoughts are without any essential nature by which they could come or go, arise or cease, or be stable or fluctuating.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཡངས་པ་ལ། སེམས་ཡངས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the grand thoughts of other beings and other persons are grand thoughts. “

source: །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཚད་མེད་པ་ལ། སེམས་ཚད་མེད་ཅེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་།
en: Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this perfection of wisdom, that the immeasurable thoughts of other beings and of other persons are immeasurable thoughts.

source: གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཚད་མེད་པ་ལ། སེམས་ཚད་མེད་ཅེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་གནས་པར་ཡང་དག་པར་རྗེས་སུ་མི་གཟིགས།
en: Subhūti, if you ask how the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this perfection of wisdom, that the immeasurable thoughts of other beings and other persons are immeasurable thoughts, in that case, Subhūti, the tathāgatas, arhats, completely awakened buddhas do not observe that the thoughts of other beings and of other persons are stable, and do not observe that they are they are unstable, accomplished, or established.

source: རྣམ་པར་གནས་པ་དང་། ཡོངས་སུ་གནས་པ་དང་། ཉེ་བར་གནས་པར་ཡང་དག་པར་རྗེས་སུ་མི་གཟིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སེམས་ཀྱི་རྒྱུད་ནི་རྟེན་མེད་ཅིང་ཚད་མེད་པ་སྟེ། སེམས་ཀྱི་རྒྱུད་དེ་དག་ལ་གང་ལ་གནས་པར་བྱ་བའི་རྟེན་མེད་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because the continuum of thought is without support and immeasurable; there is no support on which the continua of thought could be stabilized.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཚད་མེད་པ་ལ། སེམས་ཚད་མེད་ཅེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ།
en: Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this perfection of wisdom, that the immeasurable thoughts of other beings and other persons are immeasurable thoughts. {

source: སེམས་ཅན་ཕ་རོལ་དང་།
en: Ki.

source: གང་ཟག་ཕ་རོལ་གྱི་སེམས་བསྟན་དུ་མེད་པ་ལ། སེམས་བསྟན་དུ་མེད་ཅེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་།
en: IV: 63} “Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this perfection of wisdom, that the undefinable thoughts of other beings and of other persons are undefinable thoughts.

source: གང་ཟག་ཕ་རོལ་གྱི་སེམས་བསྟན་དུ་མེད་པ་ལ། སེམས་བསྟན་དུ་མེད་ཅེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། མཚན་ཉིད་མེད་པའི་སེམས་ལ། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར།
en: Subhūti, if you ask how the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the undefinable thoughts of other beings and other persons are undefinable thoughts, in that case, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know that thoughts without defining characteristics are thoughts without defining characteristics, owing to the emptiness of their own defining characteristics.

source: མཚན་ཉིད་མེད་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་བསྟན་དུ་མེད་པ་ལ་བསྟན་དུ་མེད་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ།
en: Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the undefinable thoughts of other beings and other persons are undefinable thoughts. “

source: །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་བལྟར་མེད་པ་ལ་བལྟར་མེད་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས།
en: Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the imperceptible thoughts of other beings and of other persons are imperceptible thoughts.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་བལྟར་མེད་པ་ལ། བལྟར་མེད་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པའི་སྤྱན་ལྔ་ལ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་དེ་དག་སྣང་བར་མི་འགྱུར་ཏེ།
en: Subhūti, if you ask how the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, that the imperceptible thoughts of other beings and other persons are imperceptible thoughts, in that case, Subhūti, those thoughts of other beings and of other persons do not appear to the five eyes of the tathāgatas.

source: རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་གང་ཟག་ཕ་རོལ་གྱི་སེམས་བལྟར་མེད་པ་ལ། བལྟར་མེད་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་། བཀྲམ་པ་དང་།
en: Subhūti, it is in that manner that, dependent on this profound perfection of wisdom, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know that the imperceptible thoughts of other beings and other persons are imperceptible thoughts. “

source: བཅུམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་། བཀྲམ་པ་དང་།
en: Moreover, Subhūti, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, the thoughts of other beings and of other persons that are diffused or absorbed, and expansive or narrow.

source: བཅུམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཅེ་ན། རབ་འབྱོར་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་།
en: Subhūti, if you ask how the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, the thoughts of other beings and other persons that are diffused or absorbed, and expansive or narrow, in that case, Subhūti, the tathāgatas, arhats, completely awakened buddhas know those thoughts of other beings and of other persons, in the sense that all the diffused or absorbed, expansive or narrow thoughts of other beings and other persons that arise and appear do so dependent on physical forms, and dependent on feelings, perceptions, formative predispositions and consciousness. {

source: བཀྲམ་པ་དང་། བཅུམ་པ་གང་ཇི་སྙེད་ཅིག་སྐྱེ་ཞིང་འབྱུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་གཟུགས་ལ་བརྟེན། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་བརྟེན་པས་སྐྱེ་ཞིང་འབྱུང་བར་འགྱུར་རོ་ཞེས་བྱ་བར། སེམས་ཅན་ཕ་རོལ་དང་།
en: Ki.

source: གང་ཟག་ཕ་རོལ་གྱི་སེམས་དེ་དག་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་། བཀྲམ་པ་དང་། བཅུམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །དེ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་། བཀྲམ་པ་དང་།
en: IV: 64} Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas correctly and definitively know, dependent on this profound perfection of wisdom, the thoughts of other beings and other persons that are diffused or absorbed, and expansive or narrow. “
